---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAdjacentAnalyticalSpace
source: html/d9b2876d-35ac-bcc6-5651-55db257b748a.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAdjacentAnalyticalSpace Method

Gets the secondary adjacent analytical space this surface is associated with.

## Syntax (C#)
```csharp
public EnergyAnalysisSpace GetAdjacentAnalyticalSpace()
```

## Returns
The secondary analytical space.

## Remarks
An exterior surface will only have one space adjacency.